public_html/markdown.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>markdown</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">markdown</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3af972b">1. Hugo CheatSheet</a></li>
<li><a href="#org6afe5c6">2. Emacs CheatSheet</a>
<ul>
<li><a href="#org0b6aead">2.1. outline-minor-mode</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Markdown es un lenguaje de marcado ligero creado por John Gruber y Aaron Swartz que trata de conseguir la máxima legibilidad y facilidad de publicación tanto en su forma de entrada como de salida, inspirándose en muchas convenciones existentes para marcar mensajes de correo electrónico usando texto plano.
</p>

<div id="outline-container-org3af972b" class="outline-2">
<h2 id="org3af972b"><span class="section-number-2">1.</span> <a href="https://sourceforge.net/p/hugo-generator/wiki/markdown_syntax/#md_ex_lists">Hugo CheatSheet</a></h2>
</div>

<div id="outline-container-org6afe5c6" class="outline-2">
<h2 id="org6afe5c6"><span class="section-number-2">2.</span> <a href="https://cheatography.com/xaon/cheat-sheets/emacs-markdown-mode/">Emacs CheatSheet</a></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Insertar un link &gt; C-c C-a l</li>
</ul>
</div>

<div id="outline-container-org0b6aead" class="outline-3">
<h3 id="org0b6aead"><span class="section-number-3">2.1.</span> outline-minor-mode</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Añadimos en init.el:
<code>~(add-hook 'markdown-mode-hook 'outline-minor-mode)~</code>
</p>

<ol class="org-ol">
<li>Navegación (Moverte por el índice)</li>
</ol>
<p>
C-c @ C-n (Next): Salta al siguiente encabezado.
C-c @ C-p (Previous): Salta al encabezado anterior.
C-c @ C-f (Forward): Salta al siguiente encabezado del mismo nivel
C-c @ C-b (Backward): Salta al encabezado anterior del mismo nivel.
C-c @ C-u (Up): Sube un nivel en la jerarquía (de un H3 a su H2 padre).
</p>

<ol class="org-ol">
<li>Visibilidad (Plegado de texto)</li>
</ol>
<p>
Para que el archivo "desaparezca" y solo veas la estructura:
C-c @ C-t (Hide all): Pliega todo el post. Solo verás los títulos.
C-c @ C-a (Show all): Despliega absolutamente todo.
C-c @ C-q (Hide body): Oculta todo el texto, pero deja visibles los títulos y subtítulos.
C-c @ C-e (Show entry): Despliega solo el texto del apartado en el que estás.
</p>

<ol class="org-ol">
<li>Reorganización</li>
</ol>
<p>
M-x outline-move-subtree-up: Sube toda la sección (título y contenido) por encima de la anterior.
M-x outline-move-subtree-down: Lo mismo, pero hacia abajo.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-02-13 vie 00:00</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
